sisext-sapi-services/src/main/resources/soap/schemas/templates/feasibility-request.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:tec="http://com/tecnocom">
   <soap:Header/>
   <soap:Body>
      <tec:M6ConsultarBloquearRecursos-RQ>
         <tec:FechaSolicitud>#[vars.requestDate]</tec:FechaSolicitud>
         <!--Optional:-->
         <tec:ModoConsulta>si</tec:ModoConsulta>
         <tec:CodigoUnicoDireccion>#[vars.addressCode]</tec:CodigoUnicoDireccion>
         <tec:Mayorista>#[vars.mayorista]</tec:Mayorista>
         <!--Optional:-->
         <tec:DetalleRespuesta>
            <tec:FechaRespuesta></tec:FechaRespuesta>
            <tec:Resultado></tec:Resultado>
            <!--Optional:-->
            <tec:CodigoErrorResultado>?</tec:CodigoErrorResultado>
            <!--Optional:-->
            <tec:DescripcionErrorResultado>?</tec:DescripcionErrorResultado>
         </tec:DetalleRespuesta>
         <!--Optional:-->
         <tec:RespuestaFactibilidad>
            <tec:Factible></tec:Factible>
            <tec:Tecnologia></tec:Tecnologia>
            <!--Optional:-->
            <tec:Motivo></tec:Motivo>
         </tec:RespuestaFactibilidad>
         <!--Optional:-->
         <tec:Accesos>
            <!--1 or more repetitions:-->
            <tec:Acceso>
               <tec:Tecnologia>FTTH</tec:Tecnologia>
               <!--Optional:-->
               <tec:RFS></tec:RFS>
               <!--Optional:-->
               <tec:Equipos>
                  <!--1 or more repetitions:-->
                  <tec:Equipo>
                     <tec:Secuencia></tec:Secuencia>
                     <!--Optional:-->
                     <tec:IdEquipoPadre></tec:IdEquipoPadre>
                     <tec:IdEquipo></tec:IdEquipo>
                     <tec:TipoEquipo></tec:TipoEquipo>
                     <!--Optional:-->
                     <tec:DescripcionEquipo></tec:DescripcionEquipo>
                     <!--Optional:-->
                     <tec:PuertoEquipo></tec:PuertoEquipo>
                     <!--Optional:-->
                     <tec:Tecnologia></tec:Tecnologia>
                     <!--Optional:-->
                     <tec:UbicacionElementoRed></tec:UbicacionElementoRed>
                     <!--Optional:-->
                     <tec:Atributos>
                        <!--1 or more repetitions:-->
                        <tec:AtributoEquipo>
                           <tec:NombreAtributo></tec:NombreAtributo>
                           <tec:ValorAtributo></tec:ValorAtributo>
                        </tec:AtributoEquipo>
                     </tec:Atributos>
                  </tec:Equipo>
               </tec:Equipos>
            </tec:Acceso>
         </tec:Accesos>
         <!--Optional:-->
         <tec:Notas>
            <!--1 or more repetitions:-->
            <tec:Nota>
               <tec:SeqNota></tec:SeqNota>
               <tec:DescripcionNota></tec:DescripcionNota>
            </tec:Nota>
         </tec:Notas>
         <!--Optional:-->
         <tec:Atributos>
            <!--1 or more repetitions:-->
            <tec:Atributo>
               <tec:NombreAtributo></tec:NombreAtributo>
               <tec:ValorAtributo></tec:ValorAtributo>
            </tec:Atributo>
         </tec:Atributos>
      </tec:M6ConsultarBloquearRecursos-RQ>
   </soap:Body>
</soap:Envelope>